Практос_2/src/Documents/НазначениеИнтервью/НазначениеИнтервью.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НазначениеИнтервью</name>
  <registerRecords>InformationRegister.ИсторияКандидатов</registerRecords>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекрутер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПодбора</name>
    <type>
      <types>EnumRef.Статус</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседованияИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПубликацияВакансии</name>
    <type>
      <types>DocumentRef.ПубликацияВакансии</types>
    </type>
  </attributes>
</mdclass:Document>

Практос_2/src/Enums/Статус/Статус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Статус</name>
  <enumValues>
    <name>ВОжидании</name>
  </enumValues>
  <enumValues>
    <name>СобеседованиеНазначено</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПриемаНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>Трудоустроен</name>
  </enumValues>
</mdclass:Enum>

Практос_2/src/Documents/НазначениеИнтервью/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура РезультатИнтевью(ДанныеЗаполнения, СтандартнаяОбработка)  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НазначениеИнтервью") Тогда
		// Заполнение шапки
		Вакансия = ДанныеЗаполнения.Вакансия;
		Кандидат = ДанныеЗаполнения.Кандидат;
		Рекрутер = ДанныеЗаполнения.Рекрутер;
		ЭтапПодбора = ДанныеЗаполнения.ЭтапПодбора;
	КонецЕсли;     
КонецПроцедуры   


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Проверяем, что документ новый
	Если Объект.Ссылка.Пустая() Тогда
		
		// 1. Ловим и заполняем Кандидата
		Если Параметры.Свойство("ПараметрКандидат") Тогда
			Объект.Кандидат = Параметры.ПараметрКандидат;
		КонецЕсли;
		
		// 2. Ловим и заполняем Вакансию
		Если Параметры.Свойство("ПараметрВакансия") Тогда
			Объект.Вакансия = Параметры.ПараметрВакансия;
		КонецЕсли;
		
		// 3. Ловим и заполняем Рекрутера
		// (Внимание: имя слева 'Объект.Ответственный' должно точно совпадать 
		// с именем реквизита в документе РезультатИнтервью)
		Если Параметры.Свойство("ПараметрРекрутер") Тогда
			Объект.Рекрутер = Параметры.ПараметрРекрутер;    
			Объект.ЭтапПодбора = Перечисления.Статус.СобеседованиеНазначено;
		КонецЕсли;  
		
		
	КонецЕсли;	
КонецПроцедуры
